Revit 2024 API
BuiltInFailures.GroupFailures.GroupPropagationFailedSketch Property
 Can't change Group"[Name]" with more than one instance because it has a Sketch-based element. Edit the Sketch of the element instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId GroupPropagationFailedSketch { get; }
Visual Basic
Public Shared ReadOnly Property GroupPropagationFailedSketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ GroupPropagationFailedSketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace